import React from 'react';
import type { ReactNode, FC } from 'react';
import { HomeFocusWrapper } from './styled';
import { RightOutlined } from '@ant-design/icons';
import { nanoid } from 'nanoid';
interface IProps {
  children?: ReactNode;
}
const foucus = [
  {
    _id: nanoid(),
    foucustitle:
      '“福笑”大赛日语学科活动深圳市中新中学笑一笑，烦恼全抛掉阳光灿，校园笑声飘日语赛，蒙眼玩得妙福笑脸，五官乱贴到同学们，笑得前仰倒鼻子贴，竟跑到了脚眼睛眉，互换显奇巧欢声起，乐趣真不少日语学科活动笑一笑，烦恼全抛掉在这个阳光灿烂的夏天，校园里传来了阵阵欢笑声。中新日语学科组举办了一场别开生面的日语“福笑”大赛，让学生们在欢乐中学习日语，提升了语言表达能力。本次活动通过有趣的游戏形式激发学生学习日语的兴趣提高日语口语表达能力丰富学生的课外生活营造积极向上的学习氛围福笑大赛“福笑”是一种传统游戏：参与者需要蒙上眼睛，通过队友的指示，寻找并贴上人物或动物的五官纸质卡片。在多福的脸上进行创作，这种游戏也叫“蒙眼摸像”。这次活动不仅考验了学生们的日语基础知识，还锻炼了他们的听力和团队协作能力。在活动开始前介绍了活动主题，并设计了日语知识竞赛环节，通过问答测试学生的日语基础知识，包括词汇、语法和听力，尤其是方位词及团队合作中的指示词。“福笑”大赛开始！在知识竞赛环节结束后，真正的趣味时刻来临了——“福笑”大赛开始了！学生们被分成2-4人的小组进行比赛。每组中有1-2人负责蒙眼贴五官，其余成员则用日语进行指示，教室里顿时充满了欢笑与紧张的气氛。蒙眼贴五官：小组成员中一人蒙上眼睛，另一人用日语指示他将五官卡片贴到大上的正确位置。笑声不断，有的鼻子贴到额头上，有的眼睛跑到了嘴边，场面滑稽又温馨。学生们在欢声笑语中完成了各自的“福笑”作品。小组成员们在讨论中不仅提高了日语口语能力，还加深了彼此的友情。小组合作的作品充满创意和幽默，让评委们“赞叹不已”。此次活动共收集到学生团队作品41份。由日语科教师组成的评委团队，根据比赛中的团队合作和作品的完整度等标准，评选出18份优胜作品（团队人数共27人）。~获奖名单~01一等奖高一5班肖鑫浩高一5班贝宸德高二6班牛冠溢高二5班芮海腾高二4班赖文昊高二4班麦凯怡高二4班黄嘉琪02二等奖高一4班尚令遥高一4班付睿妍高一5班钟任飞高二4班刘子怡高二4班何颖雯高二5班邓诗莹高二6班文馨悦高二6班张昊然03三等奖高一3班李思玥高一3班肖启慧高一4班冯坚高一4班姚钰岗高一5班刘雨婷高一5班张伟豪高二2班翁锦佳高二2班高傲然高二2班丘安烁高二2班高超然高二2班杨骏高二6班段钰如果您想要提前了解关于国际化学校的全面信息，家长们可以扫码关注“帮你择校”公众号了解国际学校新资讯!*综合内容来源学校，如有不妥，请告知.',
    tag: '深圳市中新中学 | 笑一笑，烦恼全抛掉：日语学科“福笑”大赛嗨翻天！',
    browse: 0,
    imageURL: `${require('../../../../assets/images/home/i9xjtxo8ba.jpg')}`
  },
  {
    _id: nanoid(),
    foucustitle:
      '从6岁到14岁从童年到少年与道尔顿8年的故事如梦般袭来的回忆哪是几个夜晚洋洋洒洒的3000多字能倾诉得完？今天，我们一起读一读“我和道尔顿的故事”一等奖作品是初见亦是重逢——致道新学校作者丨八年级杨镇赫“叮”时钟缓缓走向十二点钟，不知不觉中，这已经是我在道新的第八个年头，这也是最后一个年头了。在书桌前呆呆地听着播音机里的音乐，晚间的风在我耳边无序地吹着，困意一点点侵蚀着大脑，慢慢地，眼皮闭了起来，这八年的回忆翕忽间拥了上来。“镇赫，你看！”孔主任指着冲向食堂的学生们，向我介绍起这座美丽的校园，这是我记忆最深处和道新的开始，我更加留恋它最初的美丽名字：道尔顿新华公学。就这样，我第一次穿上了那件白色的道尔顿礼服，踏进了A203的教室，那是我们“愤怒的小鸟”家庭导师陈慧老师带我们一起玩耍的地方，也是我和道尔顿“初见”的地方。遇见它，如春水映梨花。笑一笑，转眼，已是第二年夏天。微风抚过脸颊，欢欢吹起袖口，在这个骄阳似火的季节，我遇见了陪伴我八年的朋友：赵泽霖。他机敏而富有责任心，同时还很讲义气，很热心也很幽默。很多不开心的时候他总是愿意在关键时刻出手相助，正是因为他的热心，我在面对许多问题是才能轻松应对。回忆起从前的点点滴滴，脸上就不自禁的漏出了微笑。时间像是在操场上欢快奔跑的我一样，一圈一圈的跑着，就这样，跑到了四年级。今年是我人生的一次转折点，我遇见了那位无数次出现在我一等奖作文里的她；那个“于与无声抚春弦，志在千里默无言”的她；那个如飞翔的雄鹰般自由的她。一个人的背后不止一个影子，而我的背后就站着这样一位伟大的“母亲”。回想起她的忠告，就好似三月桃花始盛开般灿烂，似海上明月共潮生般柔和。于志华教师，这位不凡的语文老师，带给了我一丝暖阳，划破银河，存于浩瀚星空之中。但不幸的是，就在同年，疫情毫无征兆的到来了。兵荒马乱之中，我们开始了网课学习，上网课的过程很苦也很累，但我们携手克服了很多的困难。这一年，是最特殊的一年。盼望着，盼望着，东风来了，校门也终于要再次打开了。这是我“重逢”道尔顿的日子。疫情的到来，是一声呐喊，喊出了全国人民的上下一心，喊出了道尔顿学子顽强不屈的品质。同时，也喊出了我心中的最美班主任：河豚。长发飘飘，眼神娇娇，回眸一笑，激起浪花涛涛；素衣围绕，光阴曜曜，手握春华写尽四年逍遥。记忆划过泪滴，秋风也轻轻匆了脸颊，泛起了微红。随着时光笔下的魔法，我仿佛回到了六年级的时候。“你们都不能再开他俩的玩笑了！”那年，人际关系格外紧张，但河豚并没有像众多新闻中的班主任那样袖手旁观，在班里替不会表达与解释的我，在我生命中迷茫的时候教会了我珍贵的道理。兜兜转转六年，也到了毕业的时候了。“宝贝们，人生就像一列不断前行的列车，这趟旅途总有人上车，但也有人下车，我们要学会放下下车的人，迎接上车的人。”小学六年的生涯如此之快，像是盛开的繁花，匆匆一刹。愿君生羽翼，一化北溟鱼。回想起小学六年的时光，有哭有笑，也总算能对自己说一句：“辛苦了，轻舟已过万重山。”但由于一些客观原因，导致我有很大可能要离开这所陪伴我六年的校园了，在毕业典礼上，我的思绪和依恋再也控制不住地涌了出来，从头哭到尾。手里捧着毕业相册与同学录，久久不能释怀。但，缘，似乎还没到头。在临近开学的时候，我收到了一个令我瞳孔地震的好消息：我还能继续在道尔顿读初中。得知此事的我开心得已经没法形容了，当时的心情就好像第一天入学时那样激动。就这样，我们又“重逢”了。但万事开头难，开心的一波尚未平息，疫情的再次失控就起来了。疫情的兵荒马乱不仅打乱了正常开学的全部计划，同时更是将我对初中生涯的期盼全都打散了。归期，又要延长了。就这样，道尔顿的云端生活便开始了，这样的“初见”方式，似乎有些新奇了，而且有些令人猜不透，摸不着。如果您想要提前了解关于国际化学校的全面信息，家长们可以扫码关注“帮你择校”公众号了解国际学校新资讯!*综合内容来源学校，如有不妥，请告知.-4人的小组进行比赛。每组中有1-2人负责蒙眼贴五官，其余成员则用日语进行指示，教室里顿时充满了欢笑与紧张的气氛。蒙眼贴五官：小组成员中一人蒙上眼睛，另一人用日语指示他将五官卡片贴到大上的正确位置。笑声不断，有的鼻子贴到额头上，有的眼睛跑到了嘴边，场面滑稽又温馨。学生们在欢声笑语中完成了各自的“福笑”作品。小组成员们在讨论中不仅提高了日语口语能力，还加深了彼此的友情。小组合作的作品充满创意和幽默，让评委们“赞叹不已”。此次活动共收集到学生团队作品41份。由日语科教师组成的评委团队，根据比赛中的团队合作和作品的完整度等标准，评选出18份优胜作品（团队人数共27人）。~获奖名单~01一等奖高一5班肖鑫浩高一5班贝宸德高二6班牛冠溢高二5班芮海腾高二4班赖文昊高二4班麦凯怡高二4班黄嘉琪02二等奖高一4班尚令遥高一4班付睿妍高一5班钟任飞高二4班刘子怡高二4班何颖雯高二5班邓诗莹高二6班文馨悦高二6班张昊然03三等奖高一3班李思玥高一3班肖启慧高一4班冯坚高一4班姚钰岗高一5班刘雨婷高一5班张伟豪高二2班翁锦佳高二2班高傲然高二2班丘安烁高二2班高超然高二2班杨骏高二6班段钰如果您想要提前了解关于国际化学校的全面信息，家长们可以扫码关注“帮你择校”公众号了解国际学校新资讯!*综合内容来源学校，如有不妥，请告知.',
    tag: '深圳市南山区道新学校 | 我和道尔顿の故事丨杨镇赫：是初见 亦是重逢（上）!*综合内容来源学校，如有不妥，请告知.',
    browse: 0,
    imageURL: `${require('../../../../assets/images/home/pirkrxvked.jpg')}`
  }
];
const HomeFocus: FC<IProps> = () => {
  return (
    <HomeFocusWrapper>
      <div className="w-3/5 m-auto">
        <div className="flex justify-between px-6">
          <div className="left">
            <img src={require('../../../../assets/images/home/see_logo.png')} alt="" />
          </div>
          <div className="right">
            更多
            <RightOutlined />
          </div>
        </div>
        <div className="w-full ">
          {foucus.map((item) => {
            return (
              <div key={item._id} className="flex w-full h-[240px] item p-2">
                <div className="left flex-1 w-[80%]">
                  <div className="h-[145px] overflow-hidden">{item.foucustitle}</div>
                  <div className="flex-1 mt-[8%] text-xs flex justify-between">
                    <span>{item.tag}</span>
                    <span>{item.browse}浏览</span>
                  </div>
                </div>
                <div className="right h-full w-[20%] ">
                  <img src={item.imageURL} alt="" className="w-[100%] h-[100%]" />
                </div>
              </div>
            );
          })}
        </div>
      </div>
    </HomeFocusWrapper>
  );
};
export default HomeFocus;
