export const homeschiillist = [
  {
    _id: '001',
    text: 'A-Level课程',
    list: [
      {
        _id: '001001',
        guide: '择校指南',
        info: 'A-Level课程是英国高中课程，是英国大学入学的必修课程，也是世界上最受欢迎的高中课程之一。'
      },
      {
        _id: '001002',
        guide: '择校指南',
        info: 'A-Level (General Certificate of Education Advanced Level) 是英国高中课程，既是英国全民课程体系，也是英国学生的大学入学考试课程'
      },
      {
        _id: '001003',
        guide: '择校指南',
        info: 'A-Level 课程目前已经发展成为全球最大的、最有影响力的国际课程。'
      },
      {
        _id: '001004',
        guide: '择校指南',
        info: 'A-Level课程体系因其标准化程度高，得到了国际的广泛认可，全球每年有数百万学生参加考试。'
      },
      {
        _id: '001005',
        guide: '择校指南',
        info: 'A-Level考试本身并没有严格的年龄限制，一般适用于年龄在16至19岁之间，处于高中阶段的学生。'
      },
      {
        _id: '001006',
        guide: '择校指南',
        info: '学生可根据自己喜欢或者擅长的3-4门科目来学习，一般用2年时间可以修完所选的3-4门科目。'
      },
      {
        _id: '001007',
        guide: '择校指南',
        info: 'A-Level考试本身并没有严格的年龄限制，一般适用于年龄在16至19岁之间，处于高中阶段的学生。'
      },
      {
        _id: '001008',
        guide: '择校指南',
        info: '学生可根据自己喜欢或者擅长的3-4门科目来学习，一般用2年时间可以修完所选的3-4门科目。'
      }
    ]
  },
  {
    _id: '002',
    text: 'IB课程',
    list: [
      {
        _id: '002001',
        guide: '择校指南',
        info: 'IB课程是国际文凭课程（International Baccalaureate Diploma Programme）的简称，是一种为全球学生提供的高中课程。',
        time: '2024-1-2'
      },
      {
        _id: '002002',
        guide: '择校指南',
        info: 'IB 课程全称是国际预科证书课程（International Baccalaureate Diploma Programme）。是国际文凭组织（IBO）为全球学生开设从幼儿园到大学预科的课程。',
        time: '2024-1-3'
      },
      {
        _id: '002003',
        guide: '择校指南',
        info: 'IB 课程自成体系，不以世界上任何一个国家的课程体系为基础。',
        time: '2024-1-4'
      },
      {
        _id: '002004',
        guide: '择校指南',
        info: 'IB 课程以人为本，打破了我们熟悉的以知识为纲的课程设置，强调的不是我们要教给孩子什么样的知识，而是我们要培养孩子成为什么样的人。',
        time: '2024-1-5'
      },
      {
        _id: '002005',
        guide: '择校指南',
        info: '从小学阶段就以十项学习者特征贯穿始终，每个单元都会有两到三个学习目标，老师在备课的时候就会思考，如何通过这些课程，赋予给孩子品格和能力，10 项学习者特征分别是：勤于探究的人、知识渊博的人、心中有爱的人、敢于冒险的人、热爱思考的人、坚持原则的人、善于沟通的人、均衡发展的人、积极反思的人、思想包容的人。',
        time: '2024-1-6'
      }
    ]
  },
  {
    _id: '003',
    text: 'HKDSE课程',
    list: [
      {
        _id: '003001',
        guide: '择校指南',
        info: 'IB课程是国际文凭课程（International Baccalaureate Diploma Programme）的简称，是一种为全球学生提供的高中课程。',
        time: '2024-1-1'
      },
      {
        _id: '003002',
        guide: '择校指南',
        info: 'IB 课程全称是国际预科证书课程（International Baccalaureate Diploma Programme）。是国际文凭组织（IBO）为全球学生开设从幼儿园到大学预科的课程。',
        time: '2024-1-2'
      },
      {
        _id: '003003',
        guide: '择校指南',
        info: 'IB 课程自成体系，不以世界上任何一个国家的课程体系为基础。',
        time: '2024-1-3'
      },
      {
        _id: '003004',
        guide: '择校指南',
        info: 'IB 课程以人为本，打破了我们熟悉的以知识为纲的课程设置，强调的不是我们要教给孩子什么样的知识，而是我们要培养孩子成为什么样的人。',
        time: '2024-1-4'
      },
      {
        _id: '003005',
        guide: '择校指南',
        info: '从小学阶段就以十项学习者特征贯穿始终，每个单元都会有两到三个学习目标，老师在备课的时候就会思考，如何通过这些课程，赋予给孩子品格和能力，10 项学习者特征分别是：勤于探究的人、知识渊博的人、心中有爱的人、敢于冒险的人、热爱思考的人、坚持原则的人、善于沟通的人、均衡发展的人、积极反思的人、思想包容的人。',
        time: '2024-1-5'
      }
    ]
  },
  {
    _id: '004',
    text: 'OSSD课程',
    list: [
      {
        _id: '004001',
        guide: '择校指南',
        info: 'IB课程是国际文凭课程（International Baccalaureate Diploma Programme）的简称，是一种为全球学生提供的高中课程。',
        time: '2024-1-1'
      },
      {
        _id: '004002',
        guide: '择校指南',
        info: 'IB 课程全称是国际预科证书课程（International Baccalaureate Diploma Programme）。是国际文凭组织（IBO）为全球学生开设从幼儿园到大学预科的课程。',
        time: '2024-1-2'
      },
      {
        _id: '004003',
        guide: '择校指南',
        info: 'IB 课程自成体系，不以世界上任何一个国家的课程体系为基础。',
        time: '2024-1-3'
      },
      {
        _id: '004004',
        guide: '择校指南',
        info: 'IB 课程以人为本，打破了我们熟悉的以知识为纲的课程设置，强调的不是我们要教给孩子什么样的知识，而是我们要培养孩子成为什么样的人。',
        time: '2024-1-4'
      },
      {
        _id: '004005',
        guide: '择校指南',
        info: '从小学阶段就以十项学习者特征贯穿始终，每个单元都会有两到三个学习目标，老师在备课的时候就会思考，如何通过这些课程，赋予给孩子品格和能力，10 项学习者特征分别是：勤于探究的人、知识渊博的人、心中有爱的人、敢于冒险的人、热爱思考的人、坚持原则的人、善于沟通的人、均衡发展的人、积极反思的人、思想包容的人。',
        time: '2024-1-5'
      }
    ]
  },
  {
    _id: '005',
    text: 'AP课程',
    list: [
      {
        _id: '005001',
        guide: '择校指南',
        info: 'IB课程是国际文凭课程（International Baccalaureate Diploma Programme）的简称，是一种为全球学生提供的高中课程。',
        time: '2024-1-1'
      },
      {
        _id: '005002',
        guide: '择校指南',
        info: 'IB 课程全称是国际预科证书课程（International Baccalaureate Diploma Programme）。是国际文凭组织（IBO）为全球学生开设从幼儿园到大学预科的课程。',
        time: '2024-1-2'
      },
      {
        _id: '005003',
        guide: '择校指南',
        info: 'IB 课程自成体系，不以世界上任何一个国家的课程体系为基础。',
        time: '2024-1-3'
      },
      {
        _id: '005004',
        guide: '择校指南',
        info: 'IB 课程以人为本，打破了我们熟悉的以知识为纲的课程设置，强调的不是我们要教给孩子什么样的知识，而是我们要培养孩子成为什么样的人。',
        time: '2024-1-4'
      },
      {
        _id: '005005',
        guide: '择校指南',
        info: '从小学阶段就以十项学习者特征贯穿始终，每个单元都会有两到三个学习目标，老师在备课的时候就会思考，如何通过这些课程，赋予给孩子品格和能力，10 项学习者特征分别是：勤于探究的人、知识渊博的人、心中有爱的人、敢于冒险的人、热爱思考的人、坚持原则的人、善于沟通的人、均衡发展的人、积极反思的人、思想包容的人。',
        time: '2024-1-5'
      }
    ]
  }
];
